Repository: JiangNanGenius/floe-agent
Catalog: FloeAgent/FloeApp/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# providers.image_provider_adapter.the_image_service_request_failed
source: The image service request failed.
zh_hans: 图片服务请求失败。

# providers.image_provider_adapter.the_image_service_returned_an_invalid
source: The image service returned an invalid result.
zh_hans: 图片服务返回了无效结果。

# providers.manage_models
source: Manage Models
zh_hans: 管理模型

# providers.manual_entry
source: Manual entry
zh_hans: 手动添加

# providers.manual_entry.hint
source: You can also add a model manually.
zh_hans: 也可以手动添加模型。

# providers.manual_fallback.hint
source: This endpoint does not support model discovery. Add models manually.
zh_hans: 此端点不支持模型发现，请手动添加模型。

# providers.model_discovery.api_key_is_invalid_or_expired
source: API key is invalid or expired: %@
zh_hans: API key 无效或已过期：%@

# providers.model_editor_view.audio_supported
source: Audio supported
zh_hans: 支持音频

# providers.model_editor_view.generation_quality
source: Generation quality
zh_hans: 生成质量

# providers.model_editor_view.image_capabilities
source: Image capabilities
zh_hans: 图片能力

# providers.model_editor_view.media_models_are_configured_by_official
source: Media models are configured by official API capabilities and do not use conversation context or output token settings.
zh_hans: 媒体模型按官方接口能力配置，不使用对话上下文或输出 Token 设置。

# providers.model_editor_view.reference
source: Reference
zh_hans: 参考素材

# providers.model_editor_view.resolution
source: Resolution
zh_hans: 分辨率

# providers.model_editor_view.sec
source: %@ sec
zh_hans: %@ 秒

# providers.model_editor_view.supported_duration
source: Supported duration
zh_hans: 支持时长

# providers.model_editor_view.supported_ratios
source: Supported ratios
zh_hans: 支持比例

# providers.model_editor_view.supports_prompt_refinement
source: Supports prompt refinement
zh_hans: 支持提示词优化

# providers.model_editor_view.supports_random_seed
source: Supports random seed
zh_hans: 支持随机种子

# providers.model_editor_view.supports_reference_images
source: Supports reference images
zh_hans: 支持参考图片

# providers.model_editor_view.supports_watermark_settings
source: Supports watermark settings
zh_hans: 支持水印设置

# providers.model_editor_view.this_is_an_advanced_custom_media
source: This is an advanced custom media model. Size, ratio, duration and quality are filled from the endpoint's actual capabilities at generation time.
zh_hans: 这是高级自定义媒体模型。尺寸、比例、时长和质量会在生成时按端点实际能力填写。

# providers.model_editor_view.up_to
source: Up to %@
zh_hans: 最多 %@ 个

# providers.model_editor_view.video_capabilities
source: Video capabilities
zh_hans: 视频能力

# providers.model_id
source: Model ID (e.g. gpt-5)
zh_hans: 模型 ID（如 gpt-5）

# providers.model_name
source: Display name (optional)
zh_hans: 显示名称（可选）

# providers.model_picker_view.official_models
source: Official models
zh_hans: 官方模型

# providers.models
source: models
zh_hans: 个模型

# providers.models_section
source: Models
zh_hans: 模型

# providers.no_models
source: No models yet. Test the connection to discover models, or add one manually.
zh_hans: 暂无模型。测试连接以发现模型，或手动添加。

# providers.preset
source: Preset
zh_hans: 预设

# providers.protocol
source: Protocol
zh_hans: 接口协议

# providers.provider_adapter_factory.dashscope_alibaba_cloud_bailian
source: DashScope (Alibaba Cloud Bailian)
zh_hans: DashScope（阿里云百炼）

# providers.provider_editor_view.hide_api_key
source: Hide API key
zh_hans: 隐藏 API key

# providers.provider_editor_view.service_purpose
source: Service purpose
zh_hans: 服务用途

# providers.provider_editor_view.show_api_key
source: Show API key
zh_hans: 显示 API key

# providers.provider_editor_view.video_models_are_an_optional_enhancement
source: Video models are an optional enhancement in Creative mode; only an image generation model is required.
zh_hans: 视频模型是创意模式的可选增强；创意模式只强制要求图片生成模型。

# providers.provider_editor_view_model.api_key_not_configured
source: API key not configured
zh_hans: 未配置 API key

# providers.provider_editor_view_model.api_key_not_saved_yet
source: API key not saved yet
zh_hans: 尚未保存 API 密钥

# providers.provider_editor_view_model.device_owner_verification_failed
source: Device owner verification failed
zh_hans: 未通过设备所有者验证

# providers.provider_editor_view_model.keychain_key_found_bytes
source: %@ Keychain: key found (%@ bytes)
zh_hans: %@ Keychain: 找到 key（%@ 字节）

# providers.provider_editor_view_model.keychain_not_found
source: %@ Keychain: not found
zh_hans: %@ Keychain: 未找到

# providers.provider_editor_view_model.local
source: Local
zh_hans: 本地

# providers.provider_editor_view_model.no_api_key_found_in_keychain
source: No API key found in Keychain
zh_hans: Keychain 中没有找到 API key

# providers.provider_editor_view_model.show_the_model_service_api_key
source: Show the model service API key after verifying identity
zh_hans: 验证身份后显示模型服务 API key

# providers.provider_list_view.add_model_provider
source: Add model provider
zh_hans: 添加模型服务商

# providers.provider_list_view.chat_model_provider
source: Chat model provider
zh_hans: 对话模型服务商

# providers.provider_list_view.choose_a_use_first_then_configure
source: Choose a use first, then configure the endpoint, credentials and model capabilities.
zh_hans: 先选择用途，再配置端点、凭据和模型能力。

# providers.provider_list_view.disabled
source: Disabled
zh_hans: 已停用

# providers.provider_list_view.image_generation_editing_provider
source: Image generation/editing provider
zh_hans: 图片生成/编辑服务商

# providers.provider_list_view.image_model_provider
source: Image model provider
zh_hans: 图像模型服务商

# providers.provider_list_view.used_for_image_generation_and_editing
source: Used for image generation and editing; the default routing is set under “Auxiliary models”.
zh_hans: 用于图片生成与编辑；默认路由在“辅助模型”中设置。

# providers.provider_list_view.video_generation_provider
source: Video generation provider
zh_hans: 视频生成服务商

# providers.provider_list_view.video_is_an_optional_enhancement_in
source: Video is an optional enhancement in Creative mode and does not affect private canvases or image creation.
zh_hans: 视频是创意模式的可选增强，不影响私人画布和图片创作。

# providers.provider_list_view.video_model_provider
source: Video model provider
zh_hans: 视频模型服务商

# providers.provider_service_role.chat_model
source: Chat model
zh_hans: 对话模型

# providers.provider_service_role.image_generation_and_editing
source: Image generation and editing
zh_hans: 图片生成与编辑

# providers.provider_service_role.video_generation_extra
source: Video generation (Extra)
zh_hans: 视频生成（Extra）

# providers.readback.failed
source: Post-save readback failed. Please try again; if it persists, restart the app.
zh_hans: 保存后读回失败，请重试；若仍失败请重启应用。

# providers.readback.mismatch
source: The saved service does not match the current form. Please try again.
zh_hans: 保存的服务与当前填写不一致，请重试。

# providers.readback.model.%@
source: Model %@ could not be saved. Please try again.
zh_hans: 模型 %@ 未能保存，请重试。

# providers.readback.model.enabled.%@
source: The enabled state of model %@ could not be saved. Please try again.
zh_hans: 模型 %@ 的启用状态未能保存，请重试。

# providers.readback.secret
source: Secret location verification failed. Please try again.
zh_hans: 密钥保存位置校验失败，请重试。

# providers.refresh_models
source: Refresh Model List
zh_hans: 刷新模型列表

# providers.save_failed
source: Save failed
zh_hans: 保存失败

# providers.save_failed.ok
source: OK
zh_hans: 知道了

# providers.search_models
source: Search models
zh_hans: 搜索模型

# providers.source_discovery
source: Discovered
zh_hans: 发现

# providers.source_manual
source: Manual
zh_hans: 手动

# providers.sync_keychain
source: Sync via iCloud Keychain
zh_hans: 通过 iCloud 钥匙串同步

# providers.sync_keychain.hint
source: Sync this provider's API key across your devices.
zh_hans: 在你的设备间同步此提供商的 API 密钥。

# providers.test_connection
source: Test Connection
zh_hans: 测试连接

# providers.test_failed
source: Connection failed
zh_hans: 连接失败

# providers.test_ok
source: Connected
zh_hans: 连接成功

# providers.tool_name_compatibility
source: Tool name compatibility mode
zh_hans: 工具名兼容模式

# providers.tool_name_compatibility.hint
source: Convert tool names with dots (e.g. workspace.createFile) to underscores for providers like DeepSeek that enforce ^[a-zA-Z0-9_-]+$.
zh_hans: 将带点号的工具名（如 workspace.createFile）转换为下划线格式，用于 DeepSeek 等要求 ^[a-zA-Z0-9_-]+$ 的供应商。

# providers.video_provider_adapter.the_provider_returned_unknown_the_task
source: The provider returned UNKNOWN: the task does not exist or its status is unknown (task_id queries are valid for 24 hours; after that this status is returned).
zh_hans: 供应商返回 UNKNOWN：任务不存在或状态未知（task_id 查询有效期 24 小时，超时后即为该状态）。

# providers.waiting_secret
source: Waiting for secret
zh_hans: 等待密钥同步

# providers.waiting_secret.hint
source: Configuration synced but the API key has not synced yet. Re-enter it to use now.
zh_hans: 配置已同步，但 API 密钥尚未同步。可重新输入以立即使用。

# providers.wire_translator.api_key_is_invalid_or_expired
source: API key is invalid or expired
zh_hans: API key 无效或已过期

# reasoning.title
source: Thinking
zh_hans: 思考过程

# remote.conversation_center.attachment_visual_evidence
source: # Attachment visual evidence %@
zh_hans: # 附件视觉证据 %@

# remote.conversation_center.context_compacted_about_tokens_the_full
source: Context compacted: about %@ → %@ tokens. The full conversation and tool records are retained.
zh_hans: 上下文已压缩：约 %@ → %@ tokens。完整会话与工具记录仍保留。

# remote.conversation_center.deleted_tasks
source: Deleted tasks
zh_hans: 已删除任务

# remote.conversation_center.loading_local_model
source: Loading local model
zh_hans: 正在加载本地模型

# remote.conversation_center.no_usable_auxiliary_vision_model_configured
source: No usable auxiliary vision model configured
zh_hans: 未配置可用的辅助视觉模型

# remote.conversation_center.no_usable_text_model_configured
source: No usable text model configured
zh_hans: 未配置可用的文本模型

# remote.conversation_center.organizing_context
source: Organizing context
zh_hans: 正在整理上下文

# remote.conversation_center.preparing
source: Preparing
zh_hans: 正在准备

# remote.conversation_center.preparing_image
source: Preparing image
zh_hans: 正在准备图片

# remote.conversation_center.reconnecting_to_the_model
source: Reconnecting to the model
zh_hans: 正在重新连接模型

# remote.conversation_center.recovery_failed_safe_to_continue
source: Recovery failed; safe to continue
zh_hans: 恢复失败，可安全继续

# remote.conversation_center.reviewing_the_answer
source: Reviewing the answer
zh_hans: 正在复核答案

# remote.conversation_center.task_paused
source: Task paused
zh_hans: 任务已暂停

# remote.conversation_center.task_saved_waiting_for_you_to
source: Task saved, waiting for you to continue
zh_hans: 任务已保存，等待你继续

# remote.conversation_center.the_auxiliary_vision_model_did_not
source: The auxiliary vision model did not respond within %@ seconds
zh_hans: 辅助视觉模型在 %@ 秒内没有完成响应

# remote.conversation_center.the_auxiliary_vision_model_request_failed
source: The auxiliary vision model request failed (%@): %@
zh_hans: 辅助视觉模型请求失败（%@）：%@

# remote.conversation_center.the_auxiliary_vision_model_returned_an
source: The auxiliary vision model returned an empty response
zh_hans: 辅助视觉模型返回了空响应

# remote.conversation_center.the_auxiliary_vision_model_returned_no
source: The auxiliary vision model returned no usable content
zh_hans: 辅助视觉模型没有返回可用内容

# remote.conversation_center.the_context_is_being_compacted_send
source: The context is being compacted; send again when it finishes. Your input was not discarded.
zh_hans: 上下文正在压缩，请完成后再发送；输入内容未丢弃。

# remote.conversation_center.the_context_is_compacting_continue_the
source: The context is compacting; continue the task when it finishes.
zh_hans: 上下文正在压缩，请完成后再继续任务。

# remote.conversation_center.the_current_task_is_running_or
source: The current task is running or compacting; run /compact when the task is idle.
zh_hans: 当前任务正在运行或压缩，请在任务空闲时执行 /compact。

# remote.conversation_center.the_event_record_changed_during_export
source: The event record changed during export; please try again.
zh_hans: 导出期间事件记录发生变化，请重试。

# remote.conversation_center.the_history_changed_during_compaction_so
source: The history changed during compaction, so the old summary was not applied; please try again.
zh_hans: 压缩期间历史发生变化，未应用旧摘要，请重试。

# remote.conversation_center.the_history_is_short_enough_no
source: The history is short enough; no compaction needed and the original records are unchanged.
zh_hans: 历史较短，无需压缩；原始记录未改变。

# remote.conversation_center.the_model_is_processing
source: The model is processing
zh_hans: 模型正在处理

# remote.conversation_center.the_task_was_deleted_private_workspaces
source: The task was deleted; %@ private workspaces are not yet cleaned up and will be retried on next launch.
zh_hans: 任务已删除，%@ 个私有工作区尚未清理，将在下次启动时重试。

# remote.conversation_center.there_is_currently_no_history_to
source: There is currently no history to compact.
zh_hans: 当前没有需要压缩的历史。

# remote.conversation_center.this_steer_has_already_started_sending
source: This steer has already started sending and cannot be withdrawn. Send a new correction message.
zh_hans: 这条引导已开始发送，无法撤回。请发送新的更正消息。

# remote.conversation_center.understanding_image
source: Understanding image
zh_hans: 正在理解图片

# risk.accesses_credentials
source: Accesses credentials
zh_hans: 访问凭据

# risk.controls_gui
source: Controls GUI
zh_hans: 控制图形界面

# risk.deletes_files
source: Deletes files
zh_hans: 删除文件

# risk.executes_remote_command
source: Runs remote commands
zh_hans: 执行远程命令

# risk.modifies_remote_system
source: Modifies remote system
zh_hans: 修改远程系统

# risk.network_access
source: Network access
zh_hans: 网络访问

# risk.reads_files
source: Reads files
zh_hans: 读取文件

# risk.sends_data_to_provider
source: Sends data to provider
zh_hans: 向提供商发送数据

# risk.writes_files
source: Writes files
zh_hans: 写入文件

# runtime.agent_runtime.a_tool_needs_you_to_finish
source: A tool needs you to finish an action to continue
zh_hans: 工具需要你完成操作后继续

# runtime.agent_runtime.approved_this_action_is_within_the
source: Approved: this action is within the current task's authorization and safety bounds.
zh_hans: 已通过：该操作在当前任务授权和安全边界内。

# runtime.agent_runtime.blocked
source: Blocked: %@
zh_hans: 已阻止：%@

# runtime.agent_runtime.failed
source: Failed: %@
zh_hans: 未通过：%@

# runtime.agent_runtime.task_checkpoint_saved_waiting_to_continue
source: Task checkpoint saved, waiting to continue
zh_hans: 任务已保存检查点，等待继续

# runtime.agent_runtime.the_paused_wait_timed_out_current
source: The paused wait timed out; current progress was saved
zh_hans: 暂停等待已超时，当前进度已保存

# runtime.agent_runtime.the_task_was_stopped_by_you
source: The task was stopped by you; current progress was saved
zh_hans: 任务已由用户停止，当前进度已保存

# runtime.conversation_run_service.task_checkpoint_saved
source: Task checkpoint saved
zh_hans: 任务已保存检查点

# runtime.harness_execution_ledger.again
source: Again
zh_hans: 再

# runtime.harness_execution_ledger.first
source: First
zh_hans: 先

# runtime.intelligence_store.a_fact_slot_in_the_same
source: A fact slot in the same scope has multiple current values; keep the newest.
zh_hans: 同一范围的事实槽位存在多个当前值，应保留最新值。

# runtime.intelligence_store.the_content_is_identical_cross_scope
source: The content is identical; cross-scope deletion still requires confirmation.
zh_hans: 内容完全相同；跨范围删除仍需确认。

# runtime.intelligence_store.the_memory_has_passed_its_validity
source: The memory has passed its validity period.
zh_hans: 记忆已超过有效期。

# runtime.intelligence_store.the_same_fact_slot_has_different
source: The same fact slot has different values across scopes; confirm before organizing.
zh_hans: 同一事实槽位跨多个范围存在不同值，需要确认后再整理。

# runtime.task_checklist_store.items_canceled
source: · %@ items canceled
zh_hans: · 已取消 %@ 项

# runtime.task_checklist_store.items_canceled.one
source: · %@ item canceled
zh_hans: · 已取消 %@ 项

# runtime.task_checklist_store.items_complete
source: %@/%@ items complete%@
zh_hans: 已完成 %@/%@ 项%@

# runtime.tool_discovery.core
source: Core
zh_hans: 核心

# runtime.tool_discovery.dual_core
source: Dual-core
zh_hans: 双核

# runtime.tool_discovery.forward
source: Forward
zh_hans: 转发

# runtime.tool_discovery.multi_core
source: Multi-core
zh_hans: 多核

# runtime.tool_discovery.multiprocessing
source: Multiprocessing
zh_hans: 多进程

# runtime.tool_discovery.multithreading
source: Multithreading
zh_hans: 多线程

# runtime.tool_discovery.parallel_compile
source: Parallel compile
zh_hans: 并行编译

# runtime.tool_discovery.parallel_compute
source: Parallel compute
zh_hans: 并行计算

# runtime.tool_discovery.port
source: Port
zh_hans: 端口

# runtime.tool_discovery.virtual_machine
source: Virtual machine
zh_hans: 虚拟机

# screenshare.broadcast_picker_view.floe_is_requesting_system_screen_sharing
source: Floe is requesting system screen-sharing approval. Tap “Start Broadcast” in the system panel; footage is written only to Floe's App Group and will be confirmed again before being sent to a vision model.
zh_hans: Floe 正在发起系统屏幕共享确认。请在系统面板中点“开始直播”；画面只写入 Floe 的 App Group，发送给视觉模型前仍会再次确认。

# screenshare.broadcast_picker_view.receiving_screen_footage
source: Receiving screen footage
zh_hans: 正在接收屏幕画面

# screenshare.broadcast_picker_view.screen_sharing
source: Screen sharing
zh_hans: 屏幕共享

# screenshare.broadcast_picker_view.share_screen_with_floe
source: Share screen with Floe
zh_hans: 共享屏幕给 Floe

# screenshare.broadcast_picker_view.start_screen_sharing
source: Start screen sharing
zh_hans: 开始屏幕共享

# screenshare.broadcast_picker_view.waiting_for_the_system_to_start
source: Waiting for the system to start screen sharing
zh_hans: 等待系统开始屏幕共享

# screenshare.screen_share_center.configured_vision_model_provider
source: Configured vision model provider
zh_hans: 配置的视觉模型服务商

# screenshare.screen_share_center.could_not_request_system_screen_sharing
source: Could not request system screen-sharing approval; restart the task and try again.
zh_hans: 无法发起系统屏幕共享确认，请重新开始任务后再试。

# screenshare.screen_share_center.no_broadcast_footage_has_been_received
source: No broadcast footage has been received yet. Confirm Floe Agent is selected in the system list and tap “Start Broadcast”.
zh_hans: 尚未收到系统广播画面。请确认已在系统列表中选择 Floe Agent 并点“开始直播”。

source: Analyzing the screen and recognizing tappable elements…
zh_hans: 正在分析屏幕，识别可点按的元素…

# screenshare.screen_share_guide_view.tap
source: Tap: %@
zh_hans: 点按：%@

# screenshare.screen_share_guide_view.waiting_for_screen_footage
source: Waiting for screen footage…
zh_hans: 等待屏幕画面…

# security.secret_ingress_scanner.background
source: Background
zh_hans: 后台

# security.secret_ingress_scanner.incorrect
source: Incorrect
zh_hans: 不正确

# security.secret_ingress_scanner.no_settings
source: No settings
zh_hans: 没有设置

# security.secret_ingress_scanner.remote_hosts
source: Remote hosts
zh_hans: 远程主机

# security.secret_ingress_scanner.remote_hosts_2
source: Remote hosts
zh_hans: 远程主机

# security.secret_ingress_scanner.same_as_before
source: Same as before
zh_hans: 还是之前的

# security.secret_ingress_scanner.set_by_me
source: Set by me
zh_hans: 我设置的

# security.secret_ingress_scanner.set_by_you
source: Set by you
zh_hans: 你设置的

# security.secret_ingress_scanner.sign_in
source: Sign in
zh_hans: 登录

# security.secret_ingress_scanner.the_earlier_one
source: The earlier one
zh_hans: 之前那个

# security.secret_ingress_scanner.website
source: Website
zh_hans: 网站

# services.description
source: Node.js and Python servers stay alive when you close a preview or switch tasks. iOS may suspend them in the background. After restarting Floe, restart the services you still need.
zh_hans: 关闭预览或切换任务不会停止 Node.js 和 Python 服务。iOS 进入后台后可能暂停执行；重新打开 Floe 后，请重启仍需使用的服务。

# services.empty
source: No local services
zh_hans: 暂无本地服务

# services.logs
source: Output and errors
zh_hans: 输出与错误

# services.logs_truncated
source: Output limit reached. Earlier captured output is retained.
zh_hans: 已达到输出上限，保留已捕获的内容。

# services.preview
source: Open preview
zh_hans: 打开预览

# services.restart
source: Start again
zh_hans: 重新启动

# services.start_hint
source: Ask the assistant to start a Node.js or Python preview server in this workspace. Its status and controls appear here.
zh_hans: 可以让助手在此工作区启动 Node.js 或 Python 网页预览服务，随后在这里查看状态与管理。

# services.starting
source: Waiting for HTTP response
zh_hans: 等待网页响应

# services.state.cancelled
source: Stopped
zh_hans: 已停止

# services.state.completed
source: Completed
zh_hans: 已结束

# services.state.failed
source: Failed
zh_hans: 失败

# services.state.interrupted
source: Interrupted · restart needed
zh_hans: 已中断 · 需要重启

# services.state.queued
source: Queued
zh_hans: 等待启动

# services.state.running
source: Running
zh_hans: 运行中

# services.stop
source: Stop service
zh_hans: 停止服务

# services.stopping
source: Stopping…
zh_hans: 正在停止…

# services.title
source: Local services
zh_hans: 本地服务

# session.connected
source: Connected
zh_hans: 已连接

# session.connecting
source: Connecting
zh_hans: 连接中

# session.ssh
source: SSH Terminal
zh_hans: SSH 终端

# session.suspended
source: Suspended
zh_hans: 已挂起

# settings.agent_permissions_view.approval_model
source: Approval model
zh_hans: 审批模型

# settings.agent_permissions_view.ask
source: Ask
zh_hans: 询问

# settings.agent_permissions_view.auto_approval_model
source: Auto-approval model
zh_hans: 自动审批模型

# settings.agent_permissions_view.auto_approve
source: Auto Approve
zh_hans: 自动审批

# settings.agent_permissions_view.confirm_full_access_as_the_default
source: Confirm Full Access as the default for new tasks
zh_hans: 确认新任务默认使用完全访问权限

# settings.agent_permissions_view.continue_and_verify_identity
source: Continue and verify identity
zh_hans: 继续并验证身份

# settings.agent_permissions_view.full_access
source: Full Access
zh_hans: 完全访问

# settings.agent_permissions_view.not_configured_asks_on_medium_risk
source: Not configured (asks on medium-risk actions)
zh_hans: 未配置（遇到中风险操作时询问）

# settings.agent_permissions_view.set_full_access_as_the_default
source: Set Full Access as the default?
zh_hans: 确认将完全访问设为默认？

# settings.agent_permissions_view.the_approval_model_gets_no_tools
source: The approval model gets no tools and can only return allow, deny or ask; any exception falls back to ask.
zh_hans: 审批模型不获得工具，只能返回允许、拒绝或询问；任何异常都会回退为询问。

# settings.agent_permissions_view.the_approval_model_setting_was_not
source: The approval model setting was not fully saved: %@
zh_hans: 审批模型设置未完整保存：%@

# settings.agent_permissions_view.this_setting_affects_only_tasks_created
source: This setting affects only tasks created later. In-task tools run automatically; catastrophic commands are always blocked and package installation still requires source review.
zh_hans: 该设置只影响以后新建的任务。任务内工具会自动执行；灾难性命令始终阻止，软件包安装仍需源码审查。

# settings.all_workspaces_files_view.all_workspaces
source: All workspaces
zh_hans: 所有工作区

# settings.all_workspaces_files_view.archived
source: Archived
zh_hans: 已归档

# settings.all_workspaces_files_view.archived_chats
source: Archived chats
zh_hans: 已归档聊天

# settings.all_workspaces_files_view.back_to_files
source: Back to files
zh_hans: 返回文件

# settings.all_workspaces_files_view.chat
source: Chat
zh_hans: 聊天

# settings.all_workspaces_files_view.chat_workspace
source: Chat workspace
zh_hans: 聊天工作区

# settings.all_workspaces_files_view.could_not_open_the_workspace
source: Could not open the workspace
zh_hans: 无法打开工作区

# settings.all_workspaces_files_view.deleted_tasks_still_have_files_to
source: %@ deleted tasks still have files to clean up
zh_hans: %@ 个已删除任务的文件尚未清理

# settings.all_workspaces_files_view.kept_documents
source: Kept documents
zh_hans: 保留的文档

# settings.all_workspaces_files_view.no_matching_workspaces
source: No matching workspaces
zh_hans: 没有匹配的工作区

# settings.all_workspaces_files_view.project
source: Project
zh_hans: 项目

# settings.all_workspaces_files_view.retry_cleanup
source: Retry cleanup
zh_hans: 重试清理

# settings.all_workspaces_files_view.search_workspaces_or_chats
source: Search workspaces or chats
zh_hans: 搜索工作区或聊天

# settings.all_workspaces_files_view.shared_projects
source: Shared projects
zh_hans: 共享项目

# settings.all_workspaces_files_view.workspace
source: Workspace
zh_hans: 工作区

# settings.appearance.automatic
source: Automatic
zh_hans: 自动

# settings.appearance.day
source: Light
zh_hans: 日间
